import nltk
import random

# список запитань та відповідей
questions = {
    "Який фільм можна переглянути в кінотеатрі цього тижня?": [
        "У кінотеатрі цього тижня показують фільм 'Інтерстеллар'.",
        "Цього тижня в кінотеатрі можна подивитися фільм 'Зелена книга'."],
    "Який музичний фестиваль відбудеться в наступні вихідні?": [
        "На наступні вихідні відбудеться фестиваль 'Хіп-хоп зірки'.",
        "У наступні вихідні відбудеться фестиваль електронної музики 'Electric Dreams'."],
    "Які місця для відпочинку можна порекомендувати у моєму місті?": [
        "У вашому місті є кілька гарних парків, наприклад, парк імені Шевченка та парк Перемоги.",
        "Якщо ви любите активний відпочинок, ви можете відвідати боулінг-клуб, який знаходиться в центрі міста."],
}

def chat():
    print("Привіт! Я можу порекомендувати розважальні заходи та відповісти на запитання. Як я можу допомогти?")
    while True:
        user_input = input().lower()
        tokens = nltk.word_tokenize(user_input)
        for question in questions:
            if nltk.sent_tokenize(question)[0] in tokens:
                answer = random.choice(questions[question])
                print(answer)
                break
            else:
                print("Вибачте, я не розумію запит.")
chat()



